In [ ]:
import pandas as pd

#데이터프레임(Dataframe)

데이터프레임 생성

In [ ]:
#데이터프레임 변환 pd.DataFrame()
dict_data = { #딕셔너리 정의(2차원 배열)
    "c0" : [1, 2, 3],
    "c1" : [4, 5, 6],
    "c2" : [7, 8, 9],
    "c3" : [10, 11, 12],
    "c4" : [13, 14, 15]
}

df = pd.DataFrame(dict_data) #딕셔너리를 데이터프레임으로 변환

print(type(df))
df #데이터프레임 출력

<class 'pandas.core.frame.DataFrame'>

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

데이터프레임의 '행 인덱스' / '열 이름' 설정하기

In [ ]:
df = pd.DataFrame(        #리스트 > 데이터프레임 변환
    [[15, "남", "덕영중"], [17, "여", "수리고"]], 
    index = ["준서", "예은"], #행 인덱스 설정
    columns = ["나이", "성별", "학교"] #열 이름 설정
)

df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리고

In [ ]:
print(df.index) #행 인덱스 출력
print(df.columns) #열 이름 출력
print()

df.loc["예은"] #행 데이터 반환

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

나이     17
성별      여
학교    수리고
Name: 예은, dtype: object

행 인덱스, 열 이름 변경

In [ ]:
#행 인덱스, 열 이름 변경1
df = pd.DataFrame(
    [[15, "남", "덕영중"], [17, "여", "수리고"]], 
    index = ["준서", "예은"], 
    columns = ["나이", "성별", "학교"]
)

df.index = ["학생1", "학생2"]
df.columns = ["연령", "남녀", "소속"]

print(df.index)
print(df.columns) 
print()

Index(['학생1', '학생2'], dtype='object')
Index(['연령', '남녀', '소속'], dtype='object')

In [ ]:
#행 인덱스, 열 이름 변경2: rename()
#'inplace = True' : 원본 객체 변경 - 해당 옵션 없을 시, 새로운 데이터프레임 객체 반환

df = pd.DataFrame(
    [[15, "남", "덕영중"], [17, "여", "수리고"]], 
    index = ["준서", "예은"], 
    columns = ["나이", "성별", "학교"]
)

df.rename(columns = {"나이":"연령", "성별":"남녀", "학교":"소속"}, inplace = True) 
df.rename(index = {"준서":"학생1", "예은":"학생2"}, inplace = True)

df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리고

행 / 열 삭제

In [ ]:
#행 삭제: .drop(행 인덱스 또는 배열, axis = 0 , inplace = True)

exam_data = {
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data, index = ["서준", "우현", "인아"])

df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df2 = df[:] #데이터프레임 df를 복사해 df2에 저장(df2의 데이터 존재)
#df2 = df : df와 데이터를 공유(df2의 데이터는 없는 것)
df2.drop("우현", axis = 0, inplace = True) #행 "우현" 제거
df2

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
df3 = df[:]
df3.drop(["우현", "인아"], axis = 0, inplace = True)
df3

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    수학  영어  음악   체육
서준  90  98  85  100

In [ ]:
#열 삭제: .drop(열 이름 또는 배열, axis = 1 , inplace = True)
exam_data = {
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data, index = ["서준", "우현", "인아"])

df4 = df[:] 
df4.drop("수학", axis = 1, inplace = True) #열 "수학" 제거
df4

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [ ]:
df5 = df[:] 
df5.drop(["영어", "음악"], axis = 1, inplace = True)
df5

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    수학   체육
서준  90  100
우현  80   90
인아  70   90

행 / 열 선택

In [ ]:
#행 선택(1개)
exam_data = {
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data, index = ["서준", "우현", "인아"])

print(df.loc["서준"],"\n") #인덱스 이름을 직접 입력해 선택
print(df.iloc[0]) #인덱스(정수형 위치)로 선택

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
#행 선택(2개 이상)
print(df.loc[["서준", "우현"]], "\n")
print(df.iloc[[0, 1]])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
#행 선택(2개 이상) - 범위 지정
print(df.loc["서준":"우현"], "\n") #행 "우현" 포함
print(df.iloc[0:1]) #행 "우현" 제외

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100

In [ ]:
#열 선택(1개)
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)

print(df["수학"], "\n") #열 "수학" 데이터 선택
print(df.영어) #열 "영어" 데이터 선택

0    90
1    80
2    70
Name: 수학, dtype: int64

0    98
1    89
2    95
Name: 영어, dtype: int64

In [ ]:
#열 선택(2개 이상)
df[["음악", "체육"]]

    음악   체육
0   85  100
1   95   90
2  100   90

원소 선택

In [ ]:
#인덱스 이름으로 선택
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)
df.set_index("이름", inplace = True) #열 "이름"을 새로운 인덱스로 지정

df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
print(df.loc["서준", "음악"]) #"서준"의 "음악" 점수
print(df.iloc[0, 2])

85
85

In [ ]:
print(df.loc["서준", ["음악", "체육"]]) #"서준"의 "음악", "체육" 점수
print(df.loc["서준", "음악":"체육"], "\n")

print(df.iloc[0, [2, 3]])
print(df.iloc[0, 2:])

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

행 / 열 추가

In [ ]:
#열 추가
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)

df["국어"] = 80 #열 "국어" 추가, 모든 학생의 점수가 80점으로 동일

df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [ ]:
#행 추가
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)

df.loc[3] = 0 #새로운 행 추가 - 같은 원소 값 입력
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [ ]:
df.loc[4] = ["동규", 90, 80, 75, 40] #새로운 행 추가 - 원소 값이 여러 개인 배열 입력
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   75   40

In [ ]:
df.loc["행5"] = df.loc[3] #새로운 행 추가 - 기존 행 복사
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   75   40
행5   0   0   0    0    0

원소 값 변경

In [ ]:
#1개의 값 변경
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)
df.set_index("이름", inplace = True)
print(df, "\n")

df.iloc[0][3] = 80 #"서준"의 "체육" 점수 변경 1
print(df, "\n")

df.loc["서준"]["체육"] = 90 #변경 2
print(df, "\n")

df.loc["서준", "체육"] = 100 #변경 3
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#여러 개의 값 변경
df.loc["서준", ["음악", "체육"]] = 50 #"서준"의 "음악, 체육" 점수를 50점으로 변경
print(df, "\n")

df.loc["서준", ["음악", "체육"]] = 100, 50
print(df)

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

행, 열 위치 바꾸기 (transpose)

In [ ]:
exam_data = {
    "이름" : ["서준", "우현", "인아"],
    "수학" : [90, 80, 70],
    "영어" : [98, 89, 95],
    "음악" : [85, 95, 100],
    "체육" : [100, 90, 90]
}

df = pd.DataFrame(exam_data)
print(df, "\n")

df = df.transpose() #메소드를 활용한 전치
print(df, "\n")

df = df.T  #클래스 속성을 활용한 전치
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

인덱스 활용

In [ ]:
#특정 열을 행 인덱스로 설정
#DataFrame.set_index(["열 이름"])

In [ ]:
#행 인덱스 재배열: reindex()
dict_data = {
    "c0" : [1, 2, 3],
    "c1" : [4, 5, 6],
    "c2" : [7, 8, 9],
    "c3" : [10, 11, 12],
    "c4" : [13, 14, 15]
}

df = pd.DataFrame(dict_data,index = ["r0", "r1", "r2"])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
new_index = ["r0", "r1", "r2", "r3", "r4"]
ndf = df.reindex(new_index) #인덱스 재지정
print(ndf, "\n")

#새롭게 추가된 "r3", "r4" 인덱스에 해당하는 모든 열은 NaN(데이터 값이 존재하지 않음)
#유효한 값으로 채우려면, 
ndf2 = df.reindex(new_index, fill_value = 0)
print(ndf2)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [ ]:
#행 인덱스 초기화: reset_index()
dict_data = {
    "c0" : [1, 2, 3],
    "c1" : [4, 5, 6],
    "c2" : [7, 8, 9],
    "c3" : [10, 11, 12],
    "c4" : [13, 14, 15]
}

df = pd.DataFrame(dict_data,index = ["r0", "r1", "r2"])
print(df, "\n")

ndf = df.reset_index()
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [ ]:
#행 인덱스를 기준으로 데이터 프레임 정렬: sort_index()
#ascending 옵션으로 오름차순, 내림차순 설정
dict_data = {
    "c0" : [1, 2, 3],
    "c1" : [4, 5, 6],
    "c2" : [7, 8, 9],
    "c3" : [10, 11, 12],
    "c4" : [13, 14, 15]
}

df = pd.DataFrame(dict_data,index = ["r0", "r1", "r2"])

#기본 설정은 오름차순
#내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending = False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

시리즈 연산

In [ ]:
#시리즈와 시리즈 사이의 '사칙연산'
student1 = pd.Series({"국어" : 100, "영어" : 80, "수학" : 90})
student2 = pd.Series({"수학" : 80, "국어" : 90, "영어" : 80 })

addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2 

print(type(division))
print()

result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index = ["덧셈", "뺄셈", "곱셈", "나눗셈"])

print(result)

<class 'pandas.core.series.Series'>

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [ ]:
#두 시리즈의 원소 개수가 다르거나, 크기가 같으나 인덱스 값이 다른 경우 NaN 처리
#같은 인덱스가 양쪽 모두에 존재해 대응되더라도 데이터 값이 NaN인 경우 NaN 처리

In [ ]:
import numpy as np

#연산 메소드를 활용한 시리즈 연산 
student1 = pd.Series({"국어" : np.nan, "영어" : 80, "수학" : 90})
student2 = pd.Series({"수학" : 80, "국어" : 90, "영어" : 80 })

sr_add = student1.add(student2, fill_value = 0)
sr_sub = student1.sub(student2, fill_value = 0)
sr_mul = student1.mul(student2, fill_value = 0)
sr_div = student1.div(student2, fill_value = 0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index = ["덧셈", "뺄셈", "곱셈", "나눗셈"])

result

       국어        수학      영어
덧셈   90.0   170.000   160.0
뺄셈  -90.0    10.000     0.0
곱셈    0.0  7200.000  6400.0
나눗셈   0.0     1.125     1.0

데이터프레임 연산

In [ ]:
#데이터프레임과 숫자의 사칙연산
import seaborn as sns

titanic = sns.load_dataset("titanic") #데이터셋 불러오기
df = titanic.loc[:, ["age", "fare"]]

addition = df + 10 #데이터프레임에 숫자 더하기
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [ ]:
#데이터프레임 간의 연산
titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ["age", "fare"]]

addition = df + 10
subtraction = df - 10
subtraction

      age     fare
0    12.0  -2.7500
1    28.0  61.2833
2    16.0  -2.0750
3    25.0  43.1000
4    25.0  -1.9500
..    ...      ...
886  17.0   3.0000
887   9.0  20.0000
888   NaN  13.4500
889  16.0  20.0000
890  22.0  -2.2500

[891 rows x 2 columns]